truongbaan/NuvoM487Tetris-An-and-Minh/M487/M480_LCD_with_Touch/Tutorial_8_M480_LCD_with_Touch/main.c
/******************************************************************************
 * @file     main.c
 * @brief    This is a M480 EBI sample code to drive the LCD displaying and
 *           also utilize ADC to judge the position of finger touch.
 * @version  1.0.0
 * @Copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>

#include "NuMicro.h"
#include "EBI_LCD_Module.h"
#include "startScreenImage.h"

/*---------------------------------------------------------------------------*/
/* Define                                                                    */
/*---------------------------------------------------------------------------*/
// Game settings
#define WIDTH 14
#define HEIGHT 30
#define BLOCK_SIZE 4 // Each Tetris piece is made of 4 blocks
#define MAX_STORE 10


/*---------------------------------------------------------------------------*/
/* Global variables                                                          */
/*---------------------------------------------------------------------------*/
extern  volatile    uint8_t Timer3_flag;
extern  volatile    uint8_t Timer3_cnt;
extern uint8_t startScreen[240*320*3];
int i = 0, j = 0;
volatile char key = 'p';
volatile uint8_t keyPressed = 0;
volatile uint16_t totalSeconds;
volatile uint8_t gameDelayFlag = 0;
volatile uint32_t systick_ms = 0;
const uint32_t LEVEL1_SPEED = 6000000;
const uint32_t LEVEL2_SPEED = 5400000;
const uint32_t LEVEL3_SPEED = 4800000;
const uint32_t LEVEL4_SPEED = 4200000;
const uint32_t LEVEL5_SPEED = 3600000;
const uint32_t LEVEL6_SPEED = 3000000;
const uint32_t LEVEL7_SPEED = 2400000;
const uint32_t LEVEL8_SPEED = 1800000;
const uint32_t LEVEL9_SPEED = 1200000;
const uint32_t LEVEL10_SPEED = 600000;


// Tetris piece definitions
// 7 piece, each piece is 4x4 block big, 4 rotation
//if you want to increase block_size, you would need to redraw all of the piece too
const int pieces[7][4][4][4] = { 
    // I-piece : 1
    {{{1, 1, 1, 1},
      {0, 0, 0, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{0, 0, 1, 0},
      {0, 0, 1, 0},
      {0, 0, 1, 0},
      {0, 0, 1, 0}},

     {{0, 0, 0, 0},
      {0, 0, 0, 0},
      {1, 1, 1, 1},
      {0, 0, 0, 0}},

     {{0, 1, 0, 0},
      {0, 1, 0, 0},
      {0, 1, 0, 0},
      {0, 1, 0, 0}}},

    // J-piece : 2
    {{{2, 0, 0, 0},
      {2, 2, 2, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{0, 2, 2, 0},
      {0, 2, 0, 0},
      {0, 2, 0, 0},
      {0, 0, 0, 0}},

     {{0, 0, 0, 0},
      {2, 2, 2, 0},
      {0, 0, 2, 0},
      {0, 0, 0, 0}},

     {{0, 2, 0, 0},
      {0, 2, 0, 0},
      {2, 2, 0, 0},
      {0, 0, 0, 0}}},

    // Z-piece : 3
    {{{3, 3, 0, 0},
      {0, 3, 3, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{0, 0, 3, 0},
      {0, 3, 3, 0},
      {0, 3, 0, 0},
      {0, 0, 0, 0}},

     {{0, 0, 0, 0},
      {3, 3, 0, 0},
      {0, 3, 3, 0},
      {0, 0, 0, 0}},

     {{0, 3, 0, 0},
      {3, 3, 0, 0},
      {3, 0, 0, 0},
      {0, 0, 0, 0}}},

    // L-piece : 4
    {{{0, 0, 4, 0},
      {4, 4, 4, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{0, 4, 0, 0},
      {0, 4, 0, 0},
      {0, 4, 4, 0},
      {0, 0, 0, 0}},

     {{0, 0, 0, 0},
      {4, 4, 4, 0},
      {4, 0, 0, 0},
      {0, 0, 0, 0}},

     {{4, 4, 0, 0},
      {0, 4, 0, 0},
      {0, 4, 0, 0},
      {0, 0, 0, 0}}},

    // O-piece : 5
    {{{5, 5, 0, 0},
      {5, 5, 0, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{5, 5, 0, 0},
      {5, 5, 0, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{5, 5, 0, 0},
      {5, 5, 0, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{5, 5, 0, 0},
      {5, 5, 0, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}}},

    // S-piece : 6
    {{{0, 6, 6, 0},
      {6, 6, 0, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{0, 6, 0, 0},
      {0, 6, 6, 0},
      {0, 0, 6, 0},
      {0, 0, 0, 0}},

     {{0, 0, 0, 0},
      {0, 6, 6, 0},
      {6, 6, 0, 0},
      {0, 0, 0, 0}},

     {{6, 0, 0, 0},
      {6, 6, 0, 0},
      {0, 6, 0, 0},
      {0, 0, 0, 0}}},

    // T-piece : 7
    {{{0, 7, 0, 0},
      {7, 7, 7, 0},
      {0, 0, 0, 0},
      {0, 0, 0, 0}},

     {{0, 7, 0, 0},
      {0, 7, 7, 0},
      {0, 7, 0, 0},
      {0, 0, 0, 0}},

     {{0, 0, 0, 0},
      {7, 7, 7, 0},
      {0, 7, 0, 0},
      {0, 0, 0, 0}},

     {{0, 7, 0, 0},
      {7, 7, 0, 0},
      {0, 7, 0, 0},
      {0, 0, 0, 0}}}
    
};


/*---------------------------------------------------------------------------*/
/* Functions                                                                 */
/*---------------------------------------------------------------------------*/
void SYS_Init(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();
	
    /* Enable External XTAL (4~24 MHz) */
    CLK_EnableXtalRC(CLK_PWRCTL_HXTEN_Msk);

    /* Waiting for 12MHz clock ready */
    CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

    /* Switch HCLK clock source to HXT */
    CLK_SetHCLK(CLK_CLKSEL0_HCLKSEL_HXT,CLK_CLKDIV0_HCLK(1));

    /* Set core clock as PLL_CLOCK from PLL */
    CLK_SetCoreClock(FREQ_192MHZ);

    /* Set both PCLK0 and PCLK1 as HCLK/2 */
    CLK->PCLKDIV = CLK_PCLKDIV_PCLK0DIV2 | CLK_PCLKDIV_PCLK1DIV2;
	
		CLK->PWRCTL |= CLK_PWRCTL_LXTEN_Msk;
    while((CLK->STATUS & CLK_STATUS_LXTSTB_Msk) == 0);

    /* Select IP clock source */
    CLK_SetModuleClock(UART0_MODULE, CLK_CLKSEL1_UART0SEL_HXT, CLK_CLKDIV0_UART0(1));
    CLK_SetModuleClock(EADC_MODULE, 0, CLK_CLKDIV0_EADC(8));
    CLK_SetModuleClock(TMR3_MODULE, CLK_CLKSEL1_TMR3SEL_HXT, 0);
		CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR0SEL_HXT, 0);
		CLK_SetModuleClock(TMR0_MODULE, CLK_CLKSEL1_TMR1SEL_HXT, 0);

    /* Enable IP clock */
    CLK_EnableModuleClock(UART0_MODULE);
    CLK_EnableModuleClock(EBI_MODULE);
    CLK_EnableModuleClock(EADC_MODULE);
    CLK_EnableModuleClock(TMR3_MODULE);
    CLK_EnableModuleClock(TRNG_MODULE);
		CLK_EnableModuleClock(TMR0_MODULE);
		CLK_EnableModuleClock(TMR1_MODULE);


    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/

    /*=== EBI (LCD module) mult-function pins ===*/
    /* EBI AD0~5 pins on PG.9~14 */
    SYS->GPG_MFPH &= ~(SYS_GPG_MFPH_PG9MFP_Msk  | SYS_GPG_MFPH_PG10MFP_Msk |
                       SYS_GPG_MFPH_PG11MFP_Msk | SYS_GPG_MFPH_PG12MFP_Msk |
                       SYS_GPG_MFPH_PG13MFP_Msk | SYS_GPG_MFPH_PG14MFP_Msk);
    SYS->GPG_MFPH |= (SYS_GPG_MFPH_PG9MFP_EBI_AD0  | SYS_GPG_MFPH_PG10MFP_EBI_AD1 |
                      SYS_GPG_MFPH_PG11MFP_EBI_AD2 | SYS_GPG_MFPH_PG12MFP_EBI_AD3 |
                      SYS_GPG_MFPH_PG13MFP_EBI_AD4 | SYS_GPG_MFPH_PG14MFP_EBI_AD5);

