truongbaan/NuvoM487Tetris-An-and-Minh/M487/M480_LCD_with_Touch/Tutorial_8_M480_LCD_with_Touch/main.c
// func for print board
void printBoard(int board[HEIGHT][WIDTH], int score, int piece, int rotation, int posX, int posY)
{		
		int row, col;
    //system("cls");

    //printf("Tetris Game   Score: %d\n\n", score);

    for (row = 0; row < HEIGHT; row++) {
        for (col = 0; col < WIDTH; col++) {
            if (board[row][col]) {// print out the block that has been occupied
                //printf("[%d]", board[row][col]);
								LCD_DrawBlock(board[row][col] - 1, (col * 10) + 10, (row * 10) + 10);
            }
            else {
								LCD_DrawBlock(8, (col * 10) + 10, (row * 10) + 10);
                // Then check if the active piece covers this cell
                int localX = col - posX;
                int localY = row - posY;

                if ( localX >= 0 && localX < BLOCK_SIZE && localY >= 0 && localY < BLOCK_SIZE && pieces[piece][rotation][localY][localX] ) {
                    // draw falling piece
                    //printf("[%d]", (piece + 1)); // use number to define color later
										LCD_DrawBlock(piece, (col * 10) + 10, (row * 10) + 10);
                }
                else {
                    // empty cell
                    //printf("   "); // 3 width long due to 2 '[' and 1 digit (would be incrase base on the how big the screen and block size be)
                }
            }
        }
        //printf("\n");
    }

    // bottom border
    for(j = 0; j < WIDTH; j++) {
        //printf("---");
    }
    //printf("\n");
}

// Function to generate a random Tetris piece
int generatePiece() {
    return rand() % 7;
}

// Function to check if a piece can move to a new position
int canMove(int board[HEIGHT][WIDTH], int piece, int rotation, int x, int y) {
    for (i = 0; i < BLOCK_SIZE; i++) {
        for (j = 0; j < BLOCK_SIZE; j++) {
            if (pieces[piece][rotation][i][j]) {
                int newX = x + j;
                int newY = y + i;

                if (newX < 0 || newX >= WIDTH || newY >= HEIGHT || board[newY][newX])
                    return 0; // Out of bounds or collision
                if(newY < 0) //ignore checking the top of the board
                    continue;
            }
        }
    }
    return 1; // The piece can move
}

// movement functions
void movePieceDown(int board[HEIGHT][WIDTH], int *x, int *y, int piece, int rotation) {
    *y = *y + 1;
    if (!canMove(board, piece, rotation, *x, *y)) {
        *y = *y - 1; // Move it back to the original position if it can't move down
        // Lock the piece on the board
        for (i = 0; i < BLOCK_SIZE; i++) {
            for (j = 0; j < BLOCK_SIZE; j++) {
                if (pieces[piece][rotation][i][j]) {
                    board[*y + i][*x + j] = (piece + 1);
                }
            }
        }
    }
}

void movePieceLeft(int board[HEIGHT][WIDTH], int *x, int *y, int piece, int rotation) {
    *x = *x - 1;
    if (!canMove(board, piece, rotation, *x, *y)) {
        *x = *x + 1;
    }
}

void movePieceRight(int board[HEIGHT][WIDTH], int *x, int *y, int piece, int rotation) {
    *x = *x + 1;
    if (!canMove(board, piece, rotation, *x, *y)) {
        *x = *x - 1;
    }
}

void rotatePiece(int board[HEIGHT][WIDTH], int *piece, int *rotation, int *x, int *y) {
    int newRotation = (*rotation + 1) % 4;
    if (canMove(board, *piece, newRotation, *x, *y)) {
        *rotation = newRotation;
    }
}

// Function to check for completed lines and remove them
int removeLines(int board[HEIGHT][WIDTH]) {
    int linesRemoved = 0;
    for (i = HEIGHT - 1; i >= 0; i--) {
        int lineComplete = 1;
        for (j = 0; j < WIDTH; j++) {
            if (!board[i][j]) {
                lineComplete = 0;
                break;
            }
        }
        if (lineComplete) {
            linesRemoved++;
            // Shift all rows above down by one row
						int k, l;
            for (k = i - 1; k >= 0; k--) {
                for (l = 0; l < WIDTH; l++) {
                    board[k + 1][l] = board[k][l];
                }
            }
            // Clear the top row
            for (l = 0; l < WIDTH; l++) {
                board[0][l] = 0;
            }
        }
    }
    return linesRemoved;
}

// Function to check for game over
int isGameOver(int board[HEIGHT][WIDTH]) {
    for (j = 0; j < WIDTH; j++) {
        if (board[0][j])
            return 1; // Game over if there is a block in the top row
    }
    return 0;
}

// Compute maximum drop distance for the current piece before collision
int computeDropDistance(int board[HEIGHT][WIDTH], int piece, int rotation, int x, int y) {
    int maxDrop = HEIGHT;  // upper bound
    // For each cell in the 4×4 piece
    for (i = 0; i < BLOCK_SIZE; i++) {
        for (j = 0; j < BLOCK_SIZE; j++) {
            if (!pieces[piece][rotation][i][j]) continue;
            int boardX = x + j;
            int boardY = y + i;
            // How far can this single block fall?
            int drop = 0;
            while (true) {
                int newY = boardY + drop + 1;
                // stop at bottom or if next cell is occupied
                if (newY >= HEIGHT || board[newY][boardX]) break;
                drop++;
            }
            // We need to stop one row before collision, so drop is correct
            if (drop < maxDrop) 
                maxDrop = drop;
        }
    }
    return maxDrop;
}

// Lock the piece into the board at its final spot
void hardDrop(int board[HEIGHT][WIDTH], int *x, int *y, int piece, int rotation) {
    int drop = computeDropDistance(board, piece, rotation, *x, *y);
    *y += drop;
    // Now immediately lock it in place
    for (i = 0; i < BLOCK_SIZE; i++) {
        for (j = 0; j < BLOCK_SIZE; j++) {
            if (pieces[piece][rotation][i][j]) {
                board[*y + i][*x + j] = (piece + 1);
            }
        }
    }
}

// Returns true if ESC was pressed (signal to exit game loop)
int key_input(int board[HEIGHT][WIDTH],int piece,int *rotation, int *x, int *y, int *rotate_amount, int *pause) {
    //if (!_kbhit())
		if (keyPressed == 0)
       return 0;

    //char key = _getch();
		//char key;
		//disableSelectiveInterrupts();
    switch (key) {
        case 'a': case 'A':
            if(*pause) break;
            movePieceLeft(board, x, y, piece, *rotation);
						keyPressed = 0;
						key = 'r';
						//enableSelectiveInterrupts();
            break;
        case 'd': case 'D':
            if(*pause) break;
            movePieceRight(board, x, y, piece, *rotation);
						keyPressed = 0;
						key = 'r';
						//enableSelectiveInterrupts();
            break;
        case 's': case 'S':
            if(*pause) break;
            movePieceDown(board, x, y, piece, *rotation);
						keyPressed = 0;
						key = 'r';
						//enableSelectiveInterrupts();
            break;
        case 'w': case 'W':
            if(*pause) break;
            rotatePiece(board, &piece, rotation, x, y);
            (*rotate_amount)++;
						keyPressed = 0;
						key = 'r';
						//enableSelectiveInterrupts();
            return 2;
        case 'v': case 'V':
            if(*pause) break;
            hardDrop(board, x, y, piece, *rotation);
						keyPressed = 0;
						key = 'r';
						//enableSelectiveInterrupts();
            break;
        case 'p': case 'P':
						keyPressed = 0;
						key = 'r';
						//enableSelectiveInterrupts();
            return 3;
        case 27:  // ESC
            return 1;
				case 'r':
						keyPressed = 0;
						//enableSelectiveInterrupts();
						return 0;
        default:
						keyPressed = 0;
						return 0;
            break;
    }
    return 0;
}

