truongbaan/NuvoM487Tetris-An-and-Minh/M487/M480_LCD_with_Touch/Tutorial_8_M480_LCD_with_Touch/main.c
void insertScore(int topscore[], int score)
{
	// Find where the new score fits
	for (i = 0; i < MAX_STORE; i++)
	{
		if (score > topscore[i]) {
			// Shift all lower scores down
			for (j = MAX_STORE - 1; j > i; j--) {
				topscore[j] = topscore [j - 1];
			}
			// Insert the new score
			topscore[i] = score;
			break;
		}
	}
}

void drawScoreScreen(int topscore[], int score)
{
	LCD_BlankArea(0, 0, LCD_W, LCD_H, C_BLACK);
	printf("Game Over!\n");
	/* Add score to top score */
	insertScore(topscore, score);
	
	/* Draw border */
	for (i = 0; i < 24; i++) {
		LCD_DrawBlock(7,i*10, 0);
		for (j = 0; j < 32; j++) {
			if (i == 0 || i == 23) {
				LCD_DrawBlock(7,i*10,j*10);
			}
			if (j == 31) {
				LCD_DrawBlock(7,i*10,j*10);
			}
		}
	}
	
	/* Print the top score text */
	LCD_PutString(80, 40, (uint8_t *)"HIGH SCORES", C_WHITE, C_BLACK);
	printf("Top score: \n");
	
	/* Print the list of top scores */
	for (i = 0; i < MAX_STORE; i++)
	{
		printf("Score: %d\n", topscore[i]);
		char buffer[12];	// Enough for a 32-bit int
		sprintf(buffer, "%d", topscore[i]);	// Convert int score to string
		LCD_PutString(80, (i * 20) + 65, (uint8_t *)buffer, C_WHITE, C_BLACK);	
	}
	
	/* Wait for user input to return to game play */
	uint16_t x = 0, y = 0;
	while(1) {	
			if(Timer3_flag == 1) {
				Timer3_flag = 0;
				
				x = Get_TP_X();
				y = Get_TP_Y();
				
				if ((x != LCD_W - 1) && (y != LCD_H - 1)) {
					PH7 = 0;
					LCD_BlankArea(0, 0, LCD_W, LCD_H, C_BLACK);
					PH7 = 1;
					break;
				}
				else if (keyPressed == 1)
				{
					LCD_BlankArea(0, 0, LCD_W, LCD_H, C_BLACK);
					key = 'p';
					keyPressed = 0;
					break;
				}
			}
	}
	LCD_BlankArea(0, 0, LCD_W, LCD_H, C_BLACK);
}

/* Draws the next piece into the next piece window	*/
void drawNextPiece(int next_piece)
{
	/* Clear the next piece display window */
	for (i = 0; i < 7; i++)
	{
		for (j = 0; j < 3; j++)
		{
			LCD_DrawBlock(8, (i + 16) * 10, (j + 3) * 10);
		}
	}
	
	/* Display next piece text */
	LCD_PutString(180, 15, (uint8_t *)"NEXT", C_WHITE, C_BLACK);

	for (i = 0; i < 4; i++)
	{
		for (j = 0; j < 4; j++)
		{
			switch (next_piece) {
				case 0:	// I-piece
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 175, (i * 10) + 40);
					break;
					
				case 1:	// J-piece
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 180, (i * 10) + 35);
					break;
					
				case 2:	// Z-piece
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 180, (i * 10) + 35);
					break;
					
				case 3:	// L-piece 
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 180, (i * 10) + 35);
					break;
					
				case 4:	// O-piece
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 185, (i * 10) + 35);
					break;
					
				case 5:	// S-piece
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 180, (i * 10) + 35);
					break;
					
				case 6:	// T-piece
					if (pieces[next_piece][0][i][j])
					LCD_DrawBlock(next_piece, (j * 10) + 180, (i * 10) + 35);
					break;
					
				default:
					break;
			}
		}
	}
}

void drawGameScore(int score)
{
	LCD_PutString(170, 80, (uint8_t *)"SCORE", C_WHITE, C_BLACK);
	char buffer[12];	// Enough for a 32-bit int
	sprintf(buffer, "%d", score);	// Convert int score to string
	LCD_PutString(170, 95, (uint8_t *)buffer, C_WHITE, C_BLACK);
}

void drawTopScore(int topScore)
{
	LCD_PutString(170, 130, (uint8_t *)"HISCORE", C_WHITE, C_BLACK);
	char buffer[12];	// Enough for a 32-bit int
	sprintf(buffer, "%d", topScore);	// Convert int score to string
	LCD_PutString(170, 145, (uint8_t *)buffer, C_WHITE, C_BLACK);
}

void drawLevel(uint8_t level)
{
	LCD_PutString(170, 180, (uint8_t *)"LEVEL", C_WHITE, C_BLACK);
	char buffer[12];	// Enough for a 32-bit int
	sprintf(buffer, "%d", level);	// Convert int score to string
	LCD_PutString(170, 195, (uint8_t *)buffer, C_WHITE, C_BLACK);
}

/* Draws the game play time in format mm:ss in the game window */
void drawTime(uint16_t total_seconds)
{
	uint8_t minutes = total_seconds / 60;
	uint8_t seconds = total_seconds % 60;
	
	char time_str[6];	// "mm:ss" + null terminator
	
	LCD_PutString(170, 230, (uint8_t *)"TIME", C_WHITE, C_BLACK);
	
	if (minutes < 100 && seconds < 60) {
		sprintf(time_str, "%02d:%02d", minutes, seconds);
		LCD_PutString(170, 245, (uint8_t *)time_str, C_WHITE, C_BLACK);
	} else {
		LCD_PutString(170, 245, (uint8_t *)"99:60", C_WHITE, C_BLACK);
	}
}

void drawPause()
{
	LCD_PutString(170, 300, (uint8_t *)"PAUSE", C_WHITE, C_BLACK);
}

int gameplay(int topscore[]){
		totalSeconds = 0;
		gameDelayFlag = 0;
    int board[HEIGHT][WIDTH];
    createBoard(board);
		
    int piece    = generatePiece();
    int rotation = 0;
    int x        = WIDTH/2 - 2;
    int y        = 0;
    int score    = 0;
    int gameSpeed    = 500000;
    int linesRemoved = 0;
    int rotate_amount = 0;
    int pause = 1;
    int next_piece = generatePiece();
		int level = 1;
		uint32_t dropDelay = 500000;

		
    while (!isGameOver(board)) {
        printBoard(board, score, piece, rotation, x, y);
				LCD_DrawGameBackground();
				drawNextPiece(next_piece);
				drawGameScore(score);
				drawTopScore(topscore[0]);
				TIMER_Start(TIMER1);
			
				/* Calculate and draw level */
				level = (score / 5) + 1;
				if (level > 10) {
					level = 10;
				}
				drawLevel(level);
				
				/* Draw the time mm:ss */
				drawTime(totalSeconds);
				
				/* Set game speed */
				switch (level) {
					case 1:
						TIMER1->CMP = LEVEL1_SPEED;
						dropDelay = 500000;
						//TIMER1->CNT = 0;
						break;
					case 2:
						TIMER1->CMP = LEVEL2_SPEED;
						dropDelay = 450000;
						//TIMER1->CNT = 0;
						break;
					case 3:
						TIMER1->CMP = LEVEL3_SPEED;
						dropDelay = 400000;
						//TIMER1->CNT = 0;
						break;
					case 4:
						TIMER1->CMP = LEVEL4_SPEED;
						dropDelay = 350000;
						//TIMER1->CNT = 0;
						break;
					case 5:
						TIMER1->CMP = LEVEL5_SPEED;
						dropDelay = 300000;
						//TIMER1->CNT = 0;
						break;
					case 6:
						TIMER1->CMP = LEVEL6_SPEED;
						dropDelay = 250000;
						//TIMER1->CNT = 0;
						break;
					case 7:
						TIMER1->CMP = LEVEL7_SPEED;
						dropDelay = 200000;
						//TIMER1->CNT = 0;
						break;
					case 8:
						TIMER1->CMP = LEVEL8_SPEED;
						dropDelay = 150000;
						//TIMER1->CNT = 0;
						break;
					case 9:
						TIMER1->CMP = LEVEL9_SPEED;
						dropDelay = 100000;
						//TIMER1->CNT = 0;
						break;
					case 10:
						TIMER1->CMP = LEVEL10_SPEED;
						dropDelay = 50000;
						//TIMER1->CNT = 0;
						break;
				}


        // handle input; if ESC, break out and end game
        int key_result = key_input(board, piece, &rotation, &x, &y, &rotate_amount, &pause);

