truongbaan/NuvoM487Tetris-An-and-Minh/M487/M480_LCD_with_Touch/Tutorial_8_M480_LCD_with_Touch/main.c
        if (key_result == 1) {
            printf("Exiting game...\n");
            return 0;
        }
        if (key_result == 3){
            pause = abs(pause - 1);
        }
        if (pause){
            CLK_SysTickDelay(gameSpeed);
						TIMER_Stop(TIMER0);
						TIMER_Stop(TIMER1);
            continue;
        } else {
					TIMER_Start(TIMER0);
					TIMER_Start(TIMER1);
				}
        if (key_result == 2){
					if(rotate_amount < 5){
						CLK_SysTickDelay(dropDelay);
						continue;
					}
        }
				

        // auto moving down					
				movePieceDown(board, &x, &y, piece, rotation);
				CLK_SysTickDelay(dropDelay);


        // clear lines & update score/speed
        linesRemoved = removeLines(board);
        if (linesRemoved) {
            score += linesRemoved;
            //gameSpeed = (gameSpeed > 100) ? gameSpeed - 50 : 100;
        }

        // if landed, spawn new piece
        if (!canMove(board, piece, rotation, x, y)) {
            piece    = next_piece;
            next_piece = generatePiece();
            rotation = 0;
            x        = WIDTH/2 - 2;
            y        = 0;
            if (isGameOver(board)) {
								drawScoreScreen(topscore, score);
                break;
            }
        }
        rotate_amount = 0;
    }

    return 1;
}

/* Initialize GPIO for Joystick, SW1, SW2  */
void GPIO_Init(void)
{
	/* Joystick (Down) 		-	PC.10				*/
	/* Joystick (Up)			-	PG.2				*/
	/* Joystick (Right) 	- PG.4				*/
	/* Joystick (Left)		- PC.9				*/
	/* Joystick (Center)	- PG.3				*/
	/* SW1								- PA.0				*/
	/* SW2								- PA.1				*/
	
	GPIO_SetMode(PA, BIT0, GPIO_MODE_INPUT);
	GPIO_SetMode(PA, BIT1, GPIO_MODE_INPUT);
	GPIO_SetMode(PG, BIT2, GPIO_MODE_INPUT);
	//GPIO_SetMode(PG, BIT3, GPIO_MODE_INPUT);
	GPIO_SetMode(PG, BIT4, GPIO_MODE_INPUT);
	GPIO_SetMode(PC, BIT9, GPIO_MODE_INPUT);
	GPIO_SetMode(PC, BIT10, GPIO_MODE_INPUT); 
	
	GPIO_EnableInt(PA, 0, GPIO_INT_RISING);
	GPIO_EnableInt(PA, 1, GPIO_INT_RISING);
	GPIO_EnableInt(PG, 2, GPIO_INT_RISING);
	//GPIO_EnableInt(PG, 3, GPIO_INT_RISING);
	GPIO_EnableInt(PG, 4, GPIO_INT_RISING);
	GPIO_EnableInt(PC, 9, GPIO_INT_RISING);
	GPIO_EnableInt(PC, 10, GPIO_INT_RISING);

  NVIC_EnableIRQ(GPA_IRQn);
	NVIC_EnableIRQ(GPG_IRQn);
	NVIC_EnableIRQ(GPC_IRQn);
	
	GPIO_SET_DEBOUNCE_TIME(GPIO_DBCTL_DBCLKSRC_LIRC, GPIO_DBCTL_DBCLKSEL_32);
  GPIO_ENABLE_DEBOUNCE(PA, BIT0);
	GPIO_ENABLE_DEBOUNCE(PA, BIT1);
	GPIO_ENABLE_DEBOUNCE(PG, BIT2);
  //GPIO_ENABLE_DEBOUNCE(PG, BIT3);
	GPIO_ENABLE_DEBOUNCE(PG, BIT4);
  GPIO_ENABLE_DEBOUNCE(PC, BIT9);
	GPIO_ENABLE_DEBOUNCE(PC, BIT10);
}

/* Debugging HardFault Handler */
void HardFault_HandlerC(uint32_t *hardfault_args)
{
    uint32_t r0  = hardfault_args[0];
    uint32_t r1  = hardfault_args[1];
    uint32_t r2  = hardfault_args[2];
    uint32_t r3  = hardfault_args[3];
    uint32_t r12 = hardfault_args[4];
    uint32_t lr  = hardfault_args[5];
    uint32_t pc  = hardfault_args[6];
    uint32_t psr = hardfault_args[7];

    printf("==== HardFault Handler ====\n");
    printf("R0  = 0x%08X\n", r0);
    printf("R1  = 0x%08X\n", r1);
    printf("R2  = 0x%08X\n", r2);
    printf("R3  = 0x%08X\n", r3);
    printf("R12 = 0x%08X\n", r12);
    printf("LR  = 0x%08X\n", lr);
    printf("PC  = 0x%08X\n", pc);
    printf("PSR = 0x%08X\n", psr);

    // Optional: halt here
    //while (1);
}

__attribute__((naked))
void HardFault_Handler(void)
{
    __asm volatile
    (
        "TST LR, #4\n"                // Test bit 2 of LR to determine stack used
        "ITE EQ\n"
        "MRSEQ R0, MSP\n"             // If 0, use MSP
        "MRSNE R0, PSP\n"             // Else, use PSP
        "B HardFault_HandlerC\n"
    );
}

/*---------------------------------------------------------------------------------------------------------*/
/*  Main Function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void)
{
    uint16_t x = 0, y = 0;
    char acString[32];

    /* Init System, IP clock and multi-function I/O
       In the end of SYS_Init() will issue SYS_LockReg()
       to lock protected register. If user want to write
       protected register, please issue SYS_UnlockReg()
       to unlock protected register if necessary */
    SYS_Init();
	
		GPIO_Init();

    /* Init UART to 115200-8n1 for print message */
    UART_Open(UART0, 57600);

    printf("\n");
    printf("+---------------------------------------------------------+\n");
    printf("|            						M487 Tetris        								|\n");
    printf("+---------------------------------------------------------+\n");
    printf("HXT clock %d Hz\n", CLK_GetHXTFreq());
    printf("CPU clock %d Hz\n", CLK_GetCPUFreq());

    /* Initialize EBI bank0 to access external LCD Module */
    EBI_Open(EBI_BANK0, EBI_BUSWIDTH_16BIT, EBI_TIMING_NORMAL, 0, EBI_CS_ACTIVE_LOW);
    EBI->CTL0 |= EBI_CTL0_CACCESS_Msk;
    EBI->TCTL0 |= (EBI_TCTL0_WAHDOFF_Msk | EBI_TCTL0_RAHDOFF_Msk);
    printf("\n[EBI CTL0:0x%08X, TCLT0:0x%08X]\n\n", EBI->CTL0, EBI->TCTL0);

    /* Init LCD Module */
    ILI9341_Initial();

    /* PB.7 BL_CTRL pin */
    PB7 = 1;

    /* Set PH7/PH6 as output mode for LED1/LED2 */
    GPIO_SetMode(PH, BIT7|BIT6, GPIO_MODE_OUTPUT);
    PH7 = 1;
    PH6 = 1;

    /* Init ADC for TP */
    /* Set input mode as single-end and enable the A/D converter */
    EADC_Open(EADC, EADC_CTL_DIFFEN_SINGLE_END);
		
    /* Init Timer3 */
    Timer3_Init();
		
		/* Open Timer0 in periodic mode, enable interrupt and 1 interrupt tick per second */
    TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 1);
    TIMER_EnableInt(TIMER0);
		NVIC_EnableIRQ(TMR0_IRQn);
		
		/* Init Timer1 */
		Timer1_Init();
		
		SysTick_Config(SystemCoreClock / 1000);

		/* Draw the start screen image */
		LCD_DrawRGBImage(startScreen);
		
		
    /* waiting 3s */
    Timer3_cnt = 0;
    while(Timer3_cnt < 5) {};

		int gamestate = 0;
		while(gamestate == 0) {
			if(Timer3_flag == 1) {
				Timer3_flag = 0;
				
				x = Get_TP_X();
				y = Get_TP_Y();
				
				if ((x != LCD_W - 1) && (y != LCD_H - 1)) {
					PH7 = 0;
					LCD_BlankArea(0, 0, LCD_W, LCD_H, C_BLACK);
					PH7 = 1;
					gamestate = 1;
				}
				else if (keyPressed == 1)
				{
					LCD_BlankArea(0, 0, LCD_W, LCD_H, C_BLACK);
					key = 'p';
					gamestate = 1;
					keyPressed = 0;
				}
			}
		}
		
		/* Seed the random generator */
		srand(SysTick->VAL ^ TIMER_GetCounter(TIMER3));
		
		int top_score[MAX_STORE] = {0};
		totalSeconds = 0;
		gameDelayFlag = 0;
    while(1) {
			LCD_DrawGameBackground();
			if(!gameplay(top_score)){
					break;
			}
    }

}